Repository: CristinaSheA/sudoku-cris
Catalog: src/locale/messages.*.xlf
Languages: ru

source: Instrucciones
ru: Инструкции

source: Acerca de
ru: О нас

source: 🤔 ¿Qué es el Sudoku?
ru: 🤔 Что такое судоку?

source: El Sudoku es un juego de lógica numérica que desafía tu mente.Con sus orígenes en Japón, se ha convertido en un favorito global para quienes buscan divertirse y ejercitarse mentalmente.
ru: Судоку - это логическая игра с числами, которая бросает вызов вашему уму. Зародившись в Японии, она стала всемирно любимой для тех, кто ищет развлечений и умственных упражнений.

source: ✨ Beneficios del Sudoku:
ru: ✨ Плюсы судоку:

source: Mejora la memoria
ru: Улучшение памяти

source: Desarrolla habilidades lógicas
ru: Развивает логические способности

source: Aumenta la concentración
ru: Улучшает концентрацию

source: 🧠 Mitos Comunes
ru: 🧠 Общие мифы

source: Mito: Solo los matemáticos pueden jugar. Realidad: ¡Cualquiera puede disfrutar del Sudoku!
ru: Миф: играть могут только математики. Факт: Любой человек может наслаждаться судоку!

source: 💬 Testimonios
ru: 💬 Отзывы

source: Siempre he amado los desafíos matemáticos, y el Sudoku se ha convertido en mi pasatiempo favorito. No solo me ayuda a mantener mi mente aguda, sino que también me ha enseñado a pensar estratégicamente y a resolver problemas de manera más eficiente. Cada vez que completo un rompecabezas, siento una gran satisfacción. Recomiendo encarecidamente el Sudoku a mis estudiantes; a menudo lo utilizo como una herramienta en mis clases para demostrar la importancia del pensamiento lógico.
ru: Я всегда любил математические задачи, и судоку стало моим любимым занятием. Она не только помогает мне сохранять остроту ума, но и научила меня мыслить стратегически и решать задачи более эффективно. Каждый раз, когда я решаю головоломку, я испытываю чувство глубокого удовлетворения. Я очень рекомендую «Судоку» своим студентам; я часто использую ее на своих занятиях, чтобы продемонстрировать важность логического мышления.

source: Descubrí el Sudoku durante la cuarentena y ha cambiado la manera en que paso mi tiempo libre. Al principio, me parecía complicado, pero a medida que practicaba, se volvió adictivo. Me encanta la sensación de ver cómo un rompecabezas que parecía imposible se va formando poco a poco. Además, he notado que mi capacidad de concentración ha mejorado desde que empecé a jugar. Es el equilibrio perfecto entre diversión y ejercicio mental.
ru: Я узнал о судоку в сорок лет, и оно изменило мое свободное время. Поначалу она казалась сложной, но по мере того как я практиковался, она стала вызывать привыкание. Мне нравится наблюдать за тем, как, казалось бы, невозможная головоломка постепенно обретает форму. Я также заметил, что с тех пор, как я начал играть, моя способность концентрироваться улучшилась. Это идеальный баланс между весельем и умственными упражнениями.

source: El Sudoku se ha convertido en una actividad familiar en casa. Mis hijos y yo pasamos horas intentando resolver diferentes niveles de dificultad juntos. No solo es una forma divertida de conectar, sino que también les ayuda a mejorar su lógica y habilidades de resolución de problemas. Es un tiempo de calidad que vale la pena, y nunca deja de ser un desafío. En cada sesión, todos terminamos con una sonrisa, ya sea que hayamos resuelto el puzzle o no.
ru: Судоку стало семейным занятием у нас дома. Мы с детьми часами пытаемся вместе решить задачи разного уровня сложности. Это не только веселый способ общения, но и помогает им развивать логику и навыки решения задач. Это качественное времяпрепровождение, которое окупается, и оно не перестает быть вызовом. Каждый сеанс мы заканчиваем с улыбкой на лице, независимо от того, решили мы головоломку или нет.

source: 👤 Sobre el Desarrollador
ru: 👤 О создателе

source: Desarrollado por Cristina Herega Pakhmutov, entusiasta de los juegos de lógica con el deseo de compartir la magia del Sudoku.
ru: Проект разработала Кристина Герега Пакмутов, любительница логических игр, желающая поделиться магией судоку.

source: 🧩 Cómo jugar al Sudoku
ru: 🧩 Как играть в судоку

source: El objetivo del Sudoku es rellenar una cuadrícula de 9x9 con dígitos de forma que cada columna, fila y sección de 3x3 contenga los números entre el 1 y el 9. Al principio del juego, la cuadrícula de 9x9 tendrá algunas casillas rellenas. Tu trabajo consiste en usar la lógica para rellenar los dígitos que faltan y completar la cuadrícula. No olvides que una jugada es incorrecta si:
ru: Цель игры «Судоку» - заполнить сетку 9x9 цифрами так, чтобы в каждом столбце, строке и секции 3x3 были числа от 1 до 9. В начале игры в сетке 9x9 будет заполнено несколько ячеек. Ваша задача - с помощью логики заполнить недостающие цифры и заполнить сетку. Не забывайте, что ход считается неправильным, если:

source: Alguna fila contiene más de un número igual del 1 al 9
ru: Любая строка содержит более одного одинакового числа от 1 до 9

source: Alguna columna contiene más de una cifra del mismo número del 1 al 9
ru: Любой столбец содержит более одной цифры одного и того же числа от 1 до 9

source: Cualquier cuadrícula de 3x3 contiene más de una cifra del mismo número del 1 al 9.
ru: Любая сетка 3x3 содержит более одной цифры одного и того же числа от 1 до 9.

source: 👍 Consejos para el Sudoku
ru: 👍 Советы по судоку

source: El Sudoku es un juego de rompecabezas divertido una vez que le coges el truco. Al mismo tiempo, aprender a jugar al Sudoku puede ser un poco intimidante para los principiantes. Por lo tanto, si usted es un completo principiante, aquí hay algunos consejos de Sudoku que puede utilizar para mejorar sus habilidades de Sudoku.
ru: Судоку - это интересная головоломка, когда вы ее освоите. В то же время новичков может немного пугать обучение игре в судоку. Поэтому, если вы совсем новичок, вот несколько советов, которые вы можете использовать, чтобы улучшить свои навыки игры в судоку.

source: Consejo 1:
ru: Совет 1:

source: Busque filas y columnas de 3x3 que contengan 5 o más números. Trabaje a través de las celdas vacías restantes, probando los números que no se han utilizado. En muchos casos, encontrará números que sólo pueden colocarse en una posición teniendo en cuenta los otros números que ya están en su fila, columna y cuadrícula de 3x3.
ru: Найдите строки и столбцы 3x3, содержащие 5 или более чисел. Пройдитесь по оставшимся пустым клеткам, пробуя числа, которые не были использованы. Во многих случаях вы найдете числа, которые можно разместить только в одной позиции, учитывая другие числа, уже имеющиеся в строке, столбце и сетке 3x3.

source: Consejo 2:
ru: Совет 2:

source: Divida visualmente la cuadrícula en 3 columnas y 3 filas. Cada columna grande tendrá 3 cuadrículas de 3x3 y cada fila tendrá 3 cuadrículas de 3x3. Ahora, busca columnas o cuadrículas que tengan 2 del mismo número. Lógicamente, debe haber una 3ª copia del mismo número en la única sección de 9 celdas que queda. Mira en cada una de las 9 posiciones restantes y comprueba si puedes encontrar la ubicación del número que falta.
ru: Визуально разделите сетку на 3 столбца и 3 ряда. В каждом большом столбце будет 3 сетки 3х3, а в каждой строке - 3 сетки 3х3. Теперь найдите столбцы или сетки, в которых есть 2 одинаковых числа. По логике вещей, в единственной оставшейся секции из 9 ячеек должен быть 3-й экземпляр того же числа. Загляните в каждую из оставшихся 9 позиций и посмотрите, сможете ли вы найти местоположение недостающего числа.

source: Fácil
ru: Легко

source: Medio
ru: Средний

source: Difícil
ru: Сложный
